In [327]:
import pandas as pd 
import seaborn as sns 
import matplotlib.pyplot as plt 
import missingno as msn 
import numpy as np 
import re

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [328]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [329]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [330]:
data = df.copy()

## task

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [331]:
## creating the new data(data) which is the copy of the original dataset (df)
data = df.copy()

# splitting the column df['From_to'] by ("_") after converting it into the string and creating sepereate columns 
## creating the data['To'] column
#data['To']   =  data.From_To.str.split("_").str[1]
data["To"] = data['From_To'].map(lambda v : v.title().split("_")[1])

# creating the data["from"] column 
data["From"] = data["From_To"].map(lambda x : x.title().split("_")[0])

## task

Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [332]:
for i in np.arange(0 , df.From_To.count()):
    if pd.isna(data["FlightNumber"].loc[i,]):
        data["FlightNumber"].loc[i,] = data['FlightNumber'].loc[i-1,] + 10 
        
data["FlightNumber"] = data["FlightNumber"].astype(int)
data["FlightNumber"]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:576: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item_labels[indexer[info_axis]]] = value

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [333]:
data.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From
0,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London
1,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London
3,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",London,Brussels

## task

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [334]:
data["RecentDelays"].values.tolist()

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [335]:
delay = pd.DataFrame(data["RecentDelays"].values.tolist())
print(len (delay.columns))
delay.head()

3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [336]:
column_dict = {}
for i in range(0,len(delay.columns)):
    key = i
    value = "delay_" + str(i+1)
    column_dict[key] = value    
print(column_dict)

{0: 'delay_1', 1: 'delay_2', 2: 'delay_3'}

                                                                                # or

In [344]:
# using the list comprehension and the zipping operation 
indexes = [x for x in delay.columns]
columns = ["delay_"+str(x+1) for x in indexes]
print(indexes)
print(columns)
columns_dictionary  = dict(zip(indexes ,columns))
print(columns_dictionary)

[0, 1, 2]
['delay_1', 'delay_2', 'delay_3']
{0: 'delay_1', 1: 'delay_2', 2: 'delay_3'}

In [345]:
delay.rename(columns=column_dict ,inplace=True )
delay.head(1)

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN

In [346]:
data = pd.concat([data , delay] , axis=1 , join="outer")
data.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From,delay_1,delay_2,delay_3
0,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London,23.0,47.0,NaN
1,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest,13.0,NaN,NaN
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",London,Brussels,67.0,32.0,NaN

## working on the column Airline

In [347]:
# here the Arlinfe columns is not orgnized well so arrange it properly 
# Extract only text from the column use seperator ("_")

In [348]:
# lambda function to extract only the text 
s = lambda x : "_".join(re.findall(r"[a-zA-z]+", x))

In [349]:
data["Airlines" ]  = data["Airline"].map(s)

In [350]:
data["Airlines" ]

0                KLM
1         Air_France
2    British_Airways
3         Air_France
4          Swiss_Air
Name: Airlines, dtype: object

In [351]:
data.head(4)

,From_To,FlightNumber,RecentDelays,Airline,To,From,delay_1,delay_2,delay_3,Airlines
0,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London,23.0,47.0,NaN,KLM
1,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid,NaN,NaN,NaN,Air_France
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London,24.0,43.0,87.0,British_Airways
3,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest,13.0,NaN,NaN,Air_France

## change the index start from 1

In [357]:
new_index = [x for x in range(1,data.shape[0] + 1)]

In [358]:
# index should be in np.array format 
data.set_index(np.array(new_index) , inplace=True )
np.array(new_index)

array([1, 2, 3, 4, 5])

In [359]:
data.head()

,From_To,FlightNumber,RecentDelays,Airline,To,From,delay_1,delay_2,delay_3,Airlines
1,LoNDon_paris,10045,"[23, 47]",KLM(!),Paris,London,23.0,47.0,NaN,KLM
2,MAdrid_miLAN,10055,[],<Air France> (12),Milan,Madrid,NaN,NaN,NaN,Air_France
3,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London,24.0,43.0,87.0,British_Airways
4,Budapest_PaRis,10075,[13],12. Air France,Paris,Budapest,13.0,NaN,NaN,Air_France
5,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",London,Brussels,67.0,32.0,NaN,Swiss_Air

## Remove the unnecessary columns

In [360]:
data.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline', 'To', 'From',
       'delay_1', 'delay_2', 'delay_3', 'Airlines'],
      dtype='object')

In [363]:
#data = data.drop(['From_To','RecentDelays' ,  'Airline'] , axis=1 )
data.head()

,FlightNumber,To,From,delay_1,delay_2,delay_3,Airlines
1,10045,Paris,London,23.0,47.0,NaN,KLM
2,10055,Milan,Madrid,NaN,NaN,NaN,Air_France
3,10065,Stockholm,London,24.0,43.0,87.0,British_Airways
4,10075,Paris,Budapest,13.0,NaN,NaN,Air_France
5,10085,London,Brussels,67.0,32.0,NaN,Swiss_Air

## End

In [322]:
l  =[x for x in range(0,5)]

In [323]:
x = [x for x in range(5,10)]

In [325]:
dict (zip(l,x))

{0: 5, 1: 6, 2: 7, 3: 8, 4: 9}